{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 80, 3], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_45", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "causal", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "conv1d_45"}, {"class_name": "Activation", "config": {"activation": "selu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["conv1d_45", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_47", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv1d_47"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_17"}, "inbound_nodes": [[["input_3", 0, 0, {}], ["conv1d_47", 0, 0, {}]]], "name": "add_17"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_48", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "causal", "strides": [1], "dilation_rate": [2], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_17", 0, 0, {}]]], "name": "conv1d_48"}, {"class_name": "Activation", "config": {"activation": "selu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["conv1d_48", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_50", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv1d_50"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_18"}, "inbound_nodes": [[["add_17", 0, 0, {}], ["conv1d_50", 0, 0, {}]]], "name": "add_18"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_51", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "causal", "strides": [1], "dilation_rate": [4], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_18", 0, 0, {}]]], "name": "conv1d_51"}, {"class_name": "Activation", "config": {"activation": "selu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["conv1d_51", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_53", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv1d_53"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_19"}, "inbound_nodes": [[["add_18", 0, 0, {}], ["conv1d_53", 0, 0, {}]]], "name": "add_19"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_54", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "causal", "strides": [1], "dilation_rate": [8], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_19", 0, 0, {}]]], "name": "conv1d_54"}, {"class_name": "Activation", "config": {"activation": "selu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["conv1d_54", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_56", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv1d_56"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_20"}, "inbound_nodes": [[["add_19", 0, 0, {}], ["conv1d_56", 0, 0, {}]]], "name": "add_20"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_57", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "causal", "strides": [1], "dilation_rate": [16], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_20", 0, 0, {}]]], "name": "conv1d_57"}, {"class_name": "Activation", "config": {"activation": "selu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["conv1d_57", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_59", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv1d_59"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_21"}, "inbound_nodes": [[["add_20", 0, 0, {}], ["conv1d_59", 0, 0, {}]]], "name": "add_21"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_60", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "causal", "strides": [1], "dilation_rate": [32], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_21", 0, 0, {}]]], "name": "conv1d_60"}, {"class_name": "Activation", "config": {"activation": "selu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["conv1d_60", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_62", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv1d_62"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_22"}, "inbound_nodes": [[["add_21", 0, 0, {}], ["conv1d_62", 0, 0, {}]]], "name": "add_22"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_63", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "causal", "strides": [1], "dilation_rate": [64], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [2]}, "inbound_nodes": [[["add_22", 0, 0, {}]]], "name": "conv1d_63"}, {"class_name": "Activation", "config": {"activation": "selu", "trainable": true, "name": "activation_23"}, "inbound_nodes": [[["conv1d_63", 0, 0, {}]]], "name": "activation_23"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_46", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv1d_46"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_49", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv1d_49"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_52", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv1d_52"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_55", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv1d_55"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_58", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv1d_58"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_61", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv1d_61"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_64", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv1d_64"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_24"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}], ["conv1d_49", 0, 0, {}], ["conv1d_52", 0, 0, {}], ["conv1d_55", 0, 0, {}], ["conv1d_58", 0, 0, {}], ["conv1d_61", 0, 0, {}], ["conv1d_64", 0, 0, {}]]], "name": "add_24"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "inbound_nodes": [[["add_24", 0, 0, {}]]], "name": "activation_24"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"seed": 42, "stddev": 0.05, "mean": 0.0}}, "name": "conv1d_66", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.0010000000474974513, "l1": 0.0}}, "filters": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1]}, "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv1d_66"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_66", 0, 0, {}]]], "name": "flatten_3"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "output", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "output"}], "input_layers": [["input_3", 0, 0]], "output_layers": [["output", 0, 0]], "name": "model_3"}, "backend": "tensorflow"}